var table = [
  ["ド", "c"],
  ["レ", "d"],
  ["ミ", "e"],
  ["ファ", "f"],
  ["フ", "f"],
  ["ソ", "g"],
  ["ラ", "a"],
  ["シ", "b"],
  ["ど", "c"],
  ["れ", "d"],
  ["み", "e"],
  ["ふぁ", "f"],
  ["ふ", "f"],
  ["そ", "g"],
  ["ら", "a"],
  ["し", "b"],
  ["♭", "-"],
  ["ｂ", "-"],
  ["♯", "+"],
  ["－", "-"],
  ["＋", "+"],
  ["＜", "<"],
  ["＞", ">"],
  ["↑", "<"],
  ["↓", ">"],
  ["ー", "^"],
]

function sutoton2tss(src) {
  table.forEach(function (pat) {
    var regex = new RegExp(pat[0], "g")
    src = src.replace(regex, pat[1])
  })
  return src
}

